Revit 2027 API
GenericZone.OccupiedVolume Property
 The occupied volume for the zone, in cubic feet.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OccupiedVolume { get; }
Public ReadOnly Property OccupiedVolume As Double
	Get
public:
property double OccupiedVolume {
	double get ();
}
member OccupiedVolume : float with get
Property Value
Double
Remarks
 The occupied volume of a space-based zone is the sum of the volumes of the spaces marked Occupiable in the zone. This property will return a value of zero for zones where this type of volume isn't applicable.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace